# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [3]:
# your answer here
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [5]:
# your answer here

data = pd.read_csv('C:\\Users\\satur\\IH-Labs\\lab-pivot-table-and-correlation\\your_code\\data\\Employee.csv')
data.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

In [6]:
data = pd.read_csv('C:\\Users\\satur\\IH-Labs\\lab-pivot-table-and-correlation\\your_code\\data\\Fitbit.csv')
data.head()

,Date,Calorie burned,Steps,Distance,Floors,Minutes Sedentary,Minutes Lightly Active,Minutes Fairly Active,Minutes Very Active,Activity Calories,MinutesOfSleep,MinutesOfBeingAwake,NumberOfAwakings,LengthOfRestInMinutes
0,08-05-2015,1934,905,0.65,0,1.355,46,0,0,1680,384,26,23,417
1,09-05-2015,3631,18925,14.11,4,611.000,316,61,60,2248,454,35,21,491
2,10-05-2015,3204,14228,10.57,1,602.000,226,14,77,1719,387,46,25,436
3,11-05-2015,2673,6756,5.02,8,749.000,190,23,4,9620,311,31,21,350
4,12-05-2015,2495,502,3.73,1,876.000,171,0,0,7360,407,65,44,491

In [7]:
data = pd.read_csv('C:\\Users\\satur\\IH-Labs\\lab-pivot-table-and-correlation\\your_code\\data\\Time_Grades.csv')
data.head()

     Name  Study time  Grade
0    Jose           4      4
1   Maria           9      7
2   David           8      9
3   Sonia          10      7
4  Samuel          20      9

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [ ]:
# Method 1
# your answer here

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [ ]:
# Method 2
# your answer here

In [ ]:
# your answer here

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [ ]:
# your answer here

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [ ]:
# your answer here

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [ ]:
# your answer here

#### Based on your comments, fill the missing values with an appropriate value.

In [ ]:
# your answer here

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [ ]:
# your answer here

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [ ]:
# your answer here

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [ ]:
# your answer here